/**
函数

函数无参数和无返回值

 */

#include <stdio.h>

// 如果函数不需要返回值, 返回值的类型应该设置为 void, 如果不写, 函数默认返回 int 类型的值
menu(void)
{
	printf("*******************************\n");
	printf("*******   1. paly   ***********\n");
	printf("*******   0. exit   ***********\n");
	printf("*******************************\n");
}

int main(void)
{
	int ret = menu();
	printf("ret = %d\n", ret);
	return 0;

}

/**

$ ./main
*******************************
*******   1. paly   ***********
*******   0. exit   ***********
*******************************
ret = 32
$

 */
