/**
指针运算

16 进制表示
0 1 2 3 4 5 6 7 8 9 a  b  c  d  e  f
0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15

指针运算有三种:
1. 指针 + - 整数
2. 指针 - 指针
3. 指针的关系运算

 */

#include <stdio.h>

////////////////////////  指针 - 指针  ////////////////////////
int main(void)
{
	/**
	指针 - 指针

	指针和指针可以相减, 指针减去指针的绝对值是指针和指针之间元素的个数
	指针和指针可以相减的前提是两个指针指向同一块内存空间(比如同一个数组)
	 */

	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
	printf("&(arr[10]) - &(arr[0]) = %ld\n", &(arr[10]) - &(arr[0]));
	printf("&(arr[9]) - &(arr[0]) = %ld\n", &(arr[9]) - &(arr[0]));
	printf("&(arr[8]) - &(arr[2]) = %ld\n", &(arr[8]) - &(arr[2]));
	printf("&(arr[2]) - &(arr[8]) = %ld\n", &(arr[2]) - &(arr[8]));

	return 0;
}

/**

# ./main
&(arr[10]) - &(arr[0]) = 10
&(arr[9]) - &(arr[0]) = 9
&(arr[8]) - &(arr[2]) = 6
&(arr[2]) - &(arr[8]) = -6
#

 */
