/**
野指针

16 进制表示
0 1 2 3 4 5 6 7 8 9 a  b  c  d  e  f
0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15

野指针就是指针指向的位置是不可知的(随机的, 不正确的, 没有明确限制的)

 */

#include <stdio.h>

////////////////////////  避免野指针 3. 指针变量不在使用时, 要及时的置为 NULL  ////////////////////////
int main(void)
{
	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
	int *p = &arr[0];
	int i = 0;
	for (i = 0; i < 10; i++) {
		*(p++) = i + 10;
	}
	p = NULL;

	if (p == NULL) {
		p = &arr[0];
	}
	for (i = 0; i < 10; i++) {
		printf("*(p++) = %d\n", *(p++));
	}

	return 0;
}

/**

# ./main
*(p++) = 10
*(p++) = 11
*(p++) = 12
*(p++) = 13
*(p++) = 14
*(p++) = 15
*(p++) = 16
*(p++) = 17
*(p++) = 18
*(p++) = 19
#

 */
